cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'prisma/prisma'

brew 'ack'
brew 'coreutils'
brew 'dislocker'
brew 'gcc'
brew 'git'
brew 'git-crypt'
brew 'git-extras'
brew 'git-flow'
brew 'gnupg'
brew 'go'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'kubectl'
brew 'macvim'
brew 'matplotlib'
brew 'mysql'
brew 'numpy'
brew 'neo4j'
brew 'node'
brew 'openssl'
brew 'postgresql'
brew 'prisma'
brew 'python3'
brew 'readline'
brew 'redis'
brew 'scipy'
brew 'sshrc'
brew 'unrar'
brew 'wget'
brew 'wordnet'
brew 'yarn'
brew 'youtube-dl'
brew 'zsh-syntax-highlighting'

cask '1password'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'macdown'
cask 'mactex'
cask 'osxfuse'
cask 'seashore'
cask 'slack'
cask 'steam'
cask 'transmission'
cask 'tunnelbear'
cask 'visual-studio-code'
cask 'vlc'
cask 'xquartz'
