cask_args appdir: '/Applications'

# Taps
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/services'

# Formulae
brew 'ack'
brew 'ansible'
brew 'asdf'
brew 'coreutils'
brew 'dislocker'
brew 'gcc'
brew 'git'
brew 'git-crypt'
brew 'git-extras'
brew 'git-flow'
brew 'gnupg'
brew 'graphviz'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'kubectl'
brew 'matplotlib'
brew 'neovim'
brew 'numpy'
brew 'node'
brew 'openssl'
brew 'postgresql'
brew 'python3'
brew 'rabbitmq'
brew 'readline'
brew 'scipy'
brew 'sshrc'
brew 'tldr'
brew 'tree'
brew 'unrar'
brew 'wget'
brew 'wordnet'
brew 'youtube-dl'
brew 'zsh-syntax-highlighting'

# Casks
cask '1password'
cask 'anaconda'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'handbrake'
cask 'iterm2'
cask 'macdown'
cask 'mactex'
cask 'osxfuse'
cask 'slack'
cask 'steam'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
cask 'xquartz'
