## $ brew bundle

# Taps
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'

# Formulae
brew 'ack'                       # Search tool like grep, but optimized for programmers
brew 'asdf'                      # Extendable version manager with support for Ruby, Node.js, Erlang & more
brew 'coreutils'                 # GNU File, Shell, and Text utilities
brew 'gcc'                       # GNU compiler collection
brew 'git'                       # Distributed revision control system
brew 'git-extras'                # Small git utilities
brew 'git-flow'                  # Extensions to follow Vincent Driessen's branching model
brew 'gnupg'                     # GNU PGP (Pretty Good Privacy)
brew 'imagemagick'               # Tools and libraries to manipulate images in many formats
brew 'jq'                        # Lightweight and flexible command-line JSON processor
brew 'kubectl'                   # The Kubernetes command-line tool
brew 'mas'                       # CLI for Mac App Store
brew 'neovim'                    # Ambitious Vim-fork focused on extensibility and agility
brew 'pipx'                      # Python apps in isolated envs
brew 'stow'                      # Dotfiles linker
brew 'tree'                      # Display directories as trees
brew 'wget'                      # Internet file retriever
brew 'wordnet'                   # Lexical database for the English language
brew 'yarn'                      # Yarn is a JS package manager that doubles down as project manager
brew 'zsh-syntax-highlighting'   # Fish shell like syntax highlighting for zsh

## casks
cask_args require_sha: true

cask 'bartender'              # Menu bar icon organizer
cask 'brave-browser'
cask 'cryptomator'            # Multi-platform client-side cloud file encryption tool
cask 'discord'
cask 'dbeaver-community'.     # DB management tool
cask 'docker'
cask 'iterm2'
cask 'macfuse'                # Cryptomator dependency
cask 'mullvad-vpn'            # VPN
cask 'obsidian'               # Knowledge base that works on top of a local folder of plain text Markdown files
cask 'postman'                # API platform
cask 'visual-studio-code'
cask 'vlc'
cask 'zotero'                 # Personal research assistant

## App Store
mas '1Password',      id: 1333542190
mas 'BetterSnapTool', id: 417375580   # Window positioning - **PAID**
mas 'iStat Menus',    id: 1319778037  # System monitoring app - **PAID**
mas 'PCalc',          id: 403504866   # Scientific calculator - **PAID**
mas 'Slack',          id: 803453959
mas 'Steam Link',     id: 1246969117  # Steam link, just because
mas 'The Unarchiver'  id: 425424353   # Data decompression utility
mas 'Xcode',          id: 497799835
